<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">WHILE Loop</h1>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">A WHILE loop in MySQL is a control flow statement that allows a block of code to be executed repeatedly as long as a specified condition is true. <br><br>The loop continues to execute the block of code until the condition becomes false.<br><br>Loops in MySQL are commonly used within stored programs, which include stored procedures, stored functions, and triggers. </div>

In [1]:
from urllib.parse import quote
encoded_password = quote("Mubeen@12345", safe="")
connection_string = f"mysql+pymysql://sweeterror404:{encoded_password}@localhost:3306/mubeen"
%load_ext sql
%sql $connection_string

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Synatx<ul>WHILE condition DO<ul>Code ;<br> Increment ;</ul>END WHILE ;</ul>
</div>

In [15]:
%%sql

CREATE PROCEDURE while_loop()
BEGIN

    SET @counter = 1;
    SET @value = 0;

    WHILE @counter <= 10 DO
        
        SET @value = @value + 1;    -- add your code here
        SET @counter = @counter + 1;
    END WHILE;

    SELECT @counter, @value;
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [16]:
%sql CALL while_loop();

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(11, 10)]

In [17]:
%%sql
DROP PROCEDURE while_loop;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">REPEAT Loop</h1>


<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
The REPEAT loop in MySQL is a control flow statement that allows a block of code to be repeatedly executed until a specified condition becomes true. <br>The primary characteristic of the REPEAT loop is that the code block is guaranteed to run at least once, regardless of the initial condition.
</div>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Here jupter-lab extension some functionality not supported So i use python mysql connector</div>

In [161]:
import mysql.connector
db = mysql.connector.connect(
    host="127.0.0.1",
    port="3306",
    user="sweeterror404", 
    password="Mubeen@12345",
    database='mubeen')

In [19]:
def query(command):
    global db 
    db.connect()
    cursor = db.cursor()
    cursor.execute(command)
    return cursor

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Synatx<ul>REPEAT <ul>Code ;<br> Increment ;</ul>UNTIL condition;<br>END REPEAT ;</ul>
</div>

In [22]:
command =  """

CREATE PROCEDURE PrintNumbersRepeat()
BEGIN
    
    SET @count = 1; 
    SET @val = 0;
    
    REPEAT
        SET @val = @val + 1;
        SET @count = @count + 1;
        
        UNTIL @count <= 10

    END REPEAT;
    SELECT @count, @val;
END;

"""
query(command)

In [23]:
%%sql
CALL PrintNumbersRepeat();

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(2, 1)]

In [95]:
%%sql
DROP PROCEDURE PrintNumbersRepeat;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Why Total Iteration of Repeat loop is 2 ? <br>i use same logic in while loop but Why repeat loop generate different values <br><ul><li>REPEAT loop :</li><ul><li>The code block is executed first, and then the condition is checked.</li></ul></ul>
<ul><li>WHILE loop :</li><ul><li>The condition is checked first, and if true, the code block is executed.</li></ul></div>

In [38]:
%%sql
CREATE PROCEDURE while_loop_1()
BEGIN

    SET @counter = 1;
    SET @value = 1;

    WHILE @counter <= 3 DO   -- first check condition check than increment 

        SET @value = @value + 1;    
        SET @counter = @counter + 1;

    END WHILE;

    SELECT @counter, @value;
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [39]:
%sql CALL while_loop_1()

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(4, 4)]

In [40]:
command =  """

CREATE PROCEDURE repeat_loop_1()
BEGIN
    
    SET @counter = 1; 
    SET @value = 1;
    
    REPEAT
        SET @value = @value + 1;
        SET @counter = @counter + 1;
        
        UNTIL @counter <= 3    -- here counter is 1 than incremented than UNTIL check the condition 
                               -- and condition is True 2 <= 3 so loop END
    END REPEAT;
    SELECT @counter, @value;
END;

"""
query(command)

In [41]:
%sql CALL repeat_loop_1()

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(2, 2)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Now Change the Repeat loop Condition</div>

In [46]:
%sql CALL repeat_loop_2()

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(4, 4)]

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">ITERATE and LEAVE Statement</h1>


<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
 ITERATE <ul><li>The ITERATE statement is used to skip the rest of the loop's body and move to the next iteration immediately.</li></ul>
    <ul><li>It is often used within conditional statements to skip the remaining code in the loop based on a certain condition.</li></ul><hr>
 LEAVE <ul><li>The LEAVE statement is used to exit the loop prematurely, bypassing the remaining iterations.</li></ul>
    <ul><li>It is often used within conditional statements to exit the loop based on a certain condition.</li></ul>
</div>

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Loop</h1>
<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">In MySQL, the LOOP statement is used to create a simple loop construct. <br><br>A loop is a control flow statement that allows a set of statements to be executed repeatedly based on a condition.<br><br>The LOOP statement doesn't have a built-in condition like WHILE or REPEAT loops; instead, it continues indefinitely until an explicit LEAVE statement is encountered.</div>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Synatx<ul>label : LOOP <ul>IF confition THEN<ul>LEAVE label ; </ul>END IF ;</ul>Iteration ;<br>END LOOP label ;</ul>
</div>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
The LOOP statement in MySQL creates an unconditional loop, meaning it continues to execute indefinitely until a LEAVE statement is encountered. <br><br>Unlike loops such as WHILE or REPEAT, the LOOP statement doesn't have an explicit condition to check before each iteration.</div>

In [59]:
%%sql
CREATE PROCEDURE loop_st()
BEGIN

    SET @counter = 1;
    my_loop: LOOP
        -- Your code here

        IF @counter >= 5 THEN
            LEAVE my_loop;  -- Exit the loop when the counter exceeds 5
        END IF;

        -- Your code here (to be repeated)

        SET @counter = @counter + 1;
    END LOOP my_loop;
    SELECT @counter;
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [60]:
%sql CALL loop_st();

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(5,)]

In [61]:
%%sql
DROP PROCEDURE loop_st;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
We also Use Break and Continue in Loops like in python <br><ul>ITERATE works likes a Continue for Skip values</ul><ul>Leave likes a Break for stop the loop</ul>But we need to use label with  Iterate or Leave Statement</div>

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
USe Iterate with While loop</div>

In [75]:
i = 1;
value = "";
while i <= 6:
    if i == 3:
        i += 1
        continue
    value += str(i)+"\n" 
    i += 1
print(value)

1
2
4
5
6

In [96]:
%%sql
CREATE PROCEDURE continue_st()
BEGIN
    SET @i = 1;
    SET @value = '';

    my_loop: WHILE @i <= 6 DO
    
        IF @i = 3 THEN
            SET @i = @i + 1;
            ITERATE my_loop;
        END IF;

    SET @value = CONCAT(@value, @i, '\n');
    SET @i = @i + 1; 

END WHILE my_loop;
SELECT @value;

END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [97]:
%%sql
CALL continue_st()

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[('1\n2\n4\n5\n6\n',)]

In [98]:
%%sql
DROP PROCEDURE continue_st;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Use Leave with While loop</div>

In [107]:
i = 1
value = ''

while i<=6:
    if i == 3:
        break
        
    value += str(i)+"\n"

    i += 1
print(value)

1
2

In [108]:
%%sql
CREATE PROCEDURE break_st()
BEGIN
    SET @i = 1;
    SET @value = '';

    my_loop: WHILE @i <= 6 DO
    
        IF @i = 3 THEN
            SET @i = @i + 1;
            LEAVE my_loop;
        END IF;

    SET @value = CONCAT(@value, @i, '\n');
    SET @i = @i + 1; 

END WHILE my_loop;
SELECT @value;

END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [109]:
%%sql
CALL break_st()

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[('1\n2\n',)]

In [112]:
%%sql
DROP PROCEDURE break_st;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Data Processing (Iterating Through Rows)</div>

In [263]:
%%sql

CREATE PROCEDURE iterations(IN start_id INT, IN end_id INT)
BEGIN
    DECLARE current_id INT;
    
    SET current_id = start_id;

    my_loop: WHILE current_id <= end_id DO
        -- Process each row
        SELECT id,Company,Price FROM laptop_bk WHERE id = current_id;

        SET current_id = current_id + 1;
    END WHILE my_loop;
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [264]:
%sql CALL iterations(2,3)

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(2, 'Apple', Decimal('47896.0'))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Cant Show all rec in jupyter-lab So create python function</div>

In [25]:
def calling_func(name,arg):
    import pandas as pd
    db.connect()
    cursor = db.cursor(dictionary=True)
    data = pd.DataFrame()
    try:
        result = cursor.callproc(name, arg)
        
        for row in cursor.stored_results():
            for record in row.fetchall():            
                data = pd.concat([data,pd.DataFrame([record])])
    
    except mysql.connector.Error as err:
        print(f"Error: {err}")
        print(f"SQL Statement: {cursor.statement}")
    finally:
        cursor.close()
        db.close()
    data = data.reset_index().drop(columns='index')
    return data

In [26]:
calling_func('iterations',(2,3))

   id Company    Price
0   2   Apple  47896.0
1   3      HP  30636.0

In [27]:
calling_func('iterations',(1,10))

   id Company     Price
0   1   Apple   71379.0
1   2   Apple   47896.0
2   3      HP   30636.0
3   4   Apple  135195.0
4   5   Apple   96096.0
5   6    Acer   21312.0
6   7   Apple  114018.0
7   8   Apple   61736.0
8   9    Asus   79654.0
9  10    Acer   41026.0

In [28]:
%sql DROP PROCEDURE iterations;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [61]:
%%sql
CREATE PROCEDURE sum_price(IN start_id INT, IN end_id INT)
BEGIN
    DECLARE current_id INT;
    SET @tmp = 0;
    SET current_id = start_id;

    my_loop: WHILE current_id <= end_id DO
        -- Process each row
        SET @pr = (SELECT Price FROM laptop_bk WHERE id = current_id);
        SET @tmp = @tmp + @pr;

        SET current_id = current_id + 1;
    END WHILE my_loop;
    SELECT @tmp;
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [83]:
%%sql
CALL sum_price(1,200)

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(Decimal('10388536.0'),)]

In [84]:
%%sql
SELECT SUM(Price) FROM laptop_bk WHERE `id` BETWEEN 1 AND 200; -- verify it is corrected or not

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(Decimal('10388536.0'),)]

In [60]:
%%sql
DROP PROCEDURE sum_price;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<h1 style="text-align:center; color:#005bbd; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Check Result in All loops again for better understand</h1>

<h1 style="text-align:left; color:#005bbd; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">While Loop</h1>

In [85]:
%%sql

CREATE PROCEDURE while_loop()
BEGIN

    SET @counter = 1;
    WHILE @counter <= 10 DO
            SELECT @counter;
        SET @counter = @counter + 1;
    END WHILE;
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [86]:
%%sql
CALL while_loop()

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1,)]

In [88]:
# check result in mysql> cli
calling_func("while_loop",())

   @counter
0         1
1         2
2         3
3         4
4         5
5         6
6         7
7         8
8         9
9        10

<h1 style="text-align:left; color:#005bbd; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Repeat Loop</h1>

In [106]:
command = """
CREATE PROCEDURE repeat_loop()
BEGIN
    
    SET @counter = 1; 
    
    REPEAT
        SELECT @counter;
        SET @counter = @counter + 1;
        
        UNTIL @counter > 12   
                               
    END REPEAT;
    SELECT @counter;
END;
"""
query(command)

In [105]:
%%sql
DROP PROCEDURE repeat_loop;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [107]:
%%sql
CALL repeat_loop()

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1,)]

In [108]:
# check result in mysql> cli
calling_func("repeat_loop",())

    @counter
0          1
1          2
2          3
3          4
4          5
5          6
6          7
7          8
8          9
9         10
10        11
11        12
12        13

<h1 style="text-align:left; color:#005bbd; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Loop Satement</h1>

In [114]:
%%sql
CREATE PROCEDURE loop_st()
BEGIN

    SET @counter = 1;
    my_loop: LOOP

        SELECT @counter;

        IF @counter >= 8 THEN
            LEAVE my_loop;  
        END IF;

        
        SET @counter = @counter + 1;
    END LOOP my_loop;
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [115]:
%%sql
CALL loop_st()

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1,)]

In [117]:
# check result in mysql> cli
calling_func("loop_st",())

   @counter
0         1
1         2
2         3
3         4
4         5
5         6
6         7
7         8


<h1 style="text-align:left; color:#005bbd; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Iterate Satement</h1>

In [118]:
%%sql
CREATE PROCEDURE continue_st()
BEGIN
    SET @i = 1;
    my_loop: WHILE @i <= 6 DO
    
        IF @i = 3 THEN
            SET @i = @i + 1;
            ITERATE my_loop;
        END IF;

    SELECT @i;

    SET @i = @i + 1; 

END WHILE my_loop;
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [119]:
%%sql
CALL continue_st()

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1,)]

In [120]:
# check result in mysql> cli
calling_func("continue_st",())

   @i
0   1
1   2
2   4
3   5
4   6


<h1 style="text-align:left; color:#005bbd; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Leave Satement</h1>

In [121]:
%%sql
CREATE PROCEDURE break_st()
BEGIN
    SET @i = 1;

    my_loop: WHILE @i <= 6 DO
    
        IF @i = 3 THEN
            SET @i = @i + 1;
            LEAVE my_loop;
        END IF;

    SELECT @i;
    SET @i = @i + 1; 

END WHILE my_loop;

END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [122]:
%%sql
CALL break_st()

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1,)]

In [123]:
# check result in mysql> cli
calling_func("break_st",())

   @i
0   1
1   2